# ----------------------------------- 題目內容 ----------------------------------- #
# 
# 國泰補習班中，有五位學生期中考的成績分別為[53, 64, 75, 19, 92]，但是老師在輸入成績的時候看反了，把五位學生的成績改成了[35, 46, 57, 91, 29]，請用一個函數來將學生的成績修正。
# 
# ----------------------------------- 預期結果 ----------------------------------- #
# 輸入: [35, 46, 57, 91, 29]
# 輸出: [53, 64, 75, 19, 92]
# ---------------------------------------------------------------------------- #
def correct_grades(wrong_grades):
    result = []
    for i in wrong_grades:
        result.append(int(str(i)[::-1]))
    return result

wrong_scores = [35, 46, 57, 91, 29]
print(correct_grades(wrong_scores))